load-testing/test.yml
config:
  # target: "http://localhost:3000/highlights"
  # target: "http://54.183.67.142/main/highlights/ssr"
  target: "http://lb-yelp-highlights-93714774.us-west-1.elb.amazonaws.com/api/highlights/ssr"
  #target: "http://54.183.67.142/main/highlights/ssr"
  phases:
    - duration: 10
      arrivalRate: 20
  processor: "./testFunctions.js"

scenarios:
  - name: "Get reviews for a business iterator"
    flow:
      - loop:
        - function: "getRandomBusinessIterator"
        - get:
            url: "/{{ iterator }}"
        count: 100
      # Print the data we're sending while debugging the script:
      # - log: "Sent a get request to /{{ iterator }}"